# coding=utf8

"""
	Split string into lines to copy-paste into InDesign for character map.

	Maybe this should duplicate lines to add italics? (It will probably require a lot of alternates.)
"""

## without duplicates for italics / alts
# u = 'AÀÁÂÃÄÅĀĂĄǺȀȂẠẢẤẦẨẪẬẮẰẲẴẶBCÇĆĈĊČḈDĎḌḎEÈÉÊËĒĔĖĘĚȄȆḔḖḜẸẺẼẾỀỂỄỆFGĜĞĠĢǦḠHĤḤḪIÌÍÎÏĨĪĬĮİȈȊḮỈỊJĴKĶLĹĻĽḶḺMṂNÑŃŅŇṄṆṈOÒÓÔÕÖŌŎŐƠǪȌȎȪȬȰṌṎṐṒỌỎỐỒỔỖỘỚỜỞỠỢPQRŔŖŘȐȒṚṞSŚŜŞŠȘṠṢṤṦṨTŢŤȚṬṮUÙÚÛÜŨŪŬŮŰŲƯȔȖṸṺỤỦỨỪỬỮỰVWŴẀẂẄXYÝŶŸȲẎỲỴỶỸZŹŻŽẒÆǼÐØǾÞĐĦĲĿŁŊŒŦƏƝǄǇǊẞΩaàáâãäåāăąǻȁȃạảấầẩẫậắằẳẵặbcçćĉċčḉdďḍḏeèéêëēĕėęěȅȇḕḗḝẹẻẽếềểễệfgĝğġģǧḡhĥḥḫiìíîïĩīĭįȉȋḯỉịjĵkķlĺļľḷḻmṃnñńņňṅṇṉoòóôõöōŏőơǫȍȏȫȭȱṍṏṑṓọỏốồổỗộớờởỡợpqrŕŗřȑȓṛṟsśŝşšșṡṣṥṧṩtţťțṭṯẗuùúûüũūŭůűųưȕȗṹṻụủứừửữựvwŵẁẃẅxyýÿŷȳẏỳỵỷỹzźżžẓßæǽðøǿþđħıĳĸŀłŉŋœŧǆǉǌȷəɲπǅǈǋʹʺʻʾʿˈˉˊˋˌªº0123456789¹²³¼½¾⁰⁴⁵⁶⁷⁸⁹₀₁₂₃₄₅₆₇₈₉⅓⅔⅛⅜⅝⅞_-‐‒–—―()[]{}⟨⟩#%‰\'\"‘’“”‚„‹›«»*†‡·•….,:;!¡?¿/\⁄|¦&§¶ℓ№′″‾+−±÷×=<>≤≥≈≠¬⁒∂∅∆∏∑∕∙√∞◊∫≡▷◁$¢£¤¥฿₡₦₨₩₪₫€ƒ₭₱₲₴₵₸₹₺₼₽₿^~´`˝ˆˇ˘˜¯¨˙˚¸˛©®™°℮←↑→↓↔↕↖↗↘↙■□▲△▶▼▽◀◆◇♡♥ﬀﬁﬂﬃﬄ'

## with duplicates for italics / alts
u = 'AÀÁÂÃÄÅĀĂĄǺȀȂẠẢẤẦẨẪẬẮẰẲẴẶBCÇĆĈĊČḈDĎḌḎEÈÉÊËĒĔĖĘĚȄȆḔḖḜẸẺẼẾỀỂỄỆFGĜĞĠĢǦḠHĤḤḪIÌÍÎÏĨĪĬĮİȈȊḮỈỊJĴKĶLĹĻĽḶḺMṂNÑŃŅŇṄṆṈOÒÓÔÕÖŌŎŐƠǪȌȎȪȬȰṌṎṐṒỌỎỐỒỔỖỘỚỜỞỠỢPQRŔŖŘȐȒṚṞSŚŜŞŠȘṠṢṤṦṨTŢŤȚṬṮUÙÚÛÜŨŪŬŮŰŲƯȔȖṸṺỤỦỨỪỬỮỰVWŴẀẂẄXYÝŶŸȲẎỲỴỶỸZŹŻŽẒÆǼÐØǾÞĐĦĲĿŁŊŒŦƏƝǄǇǊẞΩaàáâãäåāăąǻȁȃạảấầẩẫậắằẳẵặaàáâãäåāăąǻȁȃạảấầẩẫậắằẳẵặbcçćĉċčḉcçćĉċčḉdďḍḏdďḍḏeèéêëēĕėęěȅȇḕḗḝẹẻẽếềểễệeèéêëēĕėęěȅȇḕḗḝẹẻẽếềểễệffgĝğġģǧḡgĝğġģǧḡhĥḥḫhĥḥḫiìíîïĩīĭįȉȋḯỉịiìíîïĩīĭįȉȋḯỉịjĵjĵkķkķlĺļľḷḻlĺļľḷḻŀłmṃmṃnñńņňṅṇṉnñńņňṅṇṉoòóôõöōŏőơǫȍȏȫȭȱṍṏṑṓọỏốồổỗộớờởỡợpqrŕŗřȑȓṛṟrŕŗřȑȓṛṟsśŝşšșṡṣṥṧṩsśŝşšșṡṣṥṧṩtţťțṭṯẗuùúûüũūŭůűųưȕȗṹṻụủứừửữựuùúûüũūŭůűųưȕȗṹṻụủứừửữựvvwŵẁẃẅwŵẁẃẅxxyýÿŷȳẏỳỵỷỹyýÿŷȳẏỳỵỷỹzźżžẓzźżžẓßæǽðøǿþđħıĳĸŉŋœŧǆǉǌȷəɲπǅǈǋªº01123456789¼½¾⅓⅔⅛⅜⅝⅞¹²³⁰⁴⁵⁶⁷⁸⁹₀₁₂₃₄₅₆₇₈₉_‾-–—()[]{}⟨⟩#%‰\'\"‘’“”‚„‹›«»*†‡·•….,:;!¡?¿/\⁄|¦&§¶ℓ№′″−±÷×=<>≤≥≈≠¬⁒∂∅∆∏∑∕∙√∞◊∫≡$¢£¤¥฿₡₦₨₩₪₫€ƒ₭₱₲₴₵₸₹₺₼₽₿^~´`ʹʺʻʾʿˈˉˊˋ˝ˆˇ˘˜¯¨˙˚ˌ¸˛©®™°℮←↑→↓↔↕↖↗↘↙■□▲△▶▷▼▽◀◁◆◇♡♥ﬀﬁﬂﬃﬄ'

charsPerLine = 20 #16

grid = ""

for i, c in enumerate(u):
	if (i + 1) % charsPerLine == 0:
		print(c, end="\n")
		grid += f"{c}\n"
	else:
		print(c, end=" ")
		grid += f"{c} "

# copy to pasteboard
import subprocess
def write_to_clipboard(output):
	process = subprocess.Popen(
		'pbcopy', env={'LANG': 'en_US.UTF-8'}, stdin=subprocess.PIPE)
	process.communicate(output.encode('utf-8'))

write_to_clipboard(grid)